Revit 2024 API
BuiltInFailures.MEPCalculationFailures.HydraulicSeparationAmbiguity Property
 Unable to hydraulically separate until the system has flow.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId HydraulicSeparationAmbiguity { get; }
Visual Basic
Public Shared ReadOnly Property HydraulicSeparationAmbiguity As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ HydraulicSeparationAmbiguity {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace